Revit 2027 API
Transform.Basis Property
Defines the basis of the old coordinate system in the new coordinate system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ this[
	int idx
] { get; set; }
Public Property Basis (
	idx As Integer
) As XYZ
	Get
	Set
public:
property XYZ^ Basis[int idx] {
	XYZ^ get (int idx);
	void set (int idx, XYZ^ value);
}
member Basis : XYZ with get, set
Parameters
idx Int32
The index of the basis vector: 0, 1 or 2.
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown when the given index is larger than 2 in the getter and setter.
InvalidOperationException |  Thrown when the transform is internally marked as read-only.
Remarks
This corresponds to the first three column vectors of the conventional 3x4 matrix representation.
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace